  /******************************************************************************
  * @file    pluse.c
  * @author  deepseek 
  * @version V1.1
  ******************************************************************************/



#include <stdint.h>
#include <string.h>
#include    "pluse.H"
// 全局变量


#include <stdio.h>

// 定义时间间隔数组（直接使用您提供的数据）
const uint16_t timeIntervals1[] = {
237,
339,
719,
1147,
1450,
1580,
1439,
1176,
917,
781,
770,
858,
1006,
1133,
1196,
1186,
1119,
1043,
990,
975,
1008,
1044,
1077,
1093,
1085,
1062,
1034,
1022,
1028,
1037,
1051,
1059,
1062,
1060,
1050,
1046,
1037,
1039,
1047,
1055,
1062,
1055,
1052,
};


#if 0
const uint16_t timeIntervals[] = {
    240, 294, 639, 1080, 1427, 1607, 1519, 1245, 974, 764, 644, 602, 660, 829, 1092, 1366, 1542, 1569, 1439, 1220,
    985, 821, 758, 815, 996, 1241, 1462, 1573, 1537, 1371, 1135, 929, 787, 782, 884, 1093, 1326, 1508, 1561, 1471,
    1282, 1060, 879, 794, 820, 961, 1174, 1394, 1526, 1526, 1399, 1196, 991, 847, 802, 871, 1038, 1260, 1444, 1525,
    1471, 1319, 1115, 939, 836, 831, 933, 1121, 1330, 1473, 1507, 1420, 1244, 1053, 899, 831, 865, 1005, 1202, 1384,
    1487, 1474, 1351, 1167, 994, 878, 846, 920, 1078, 1266, 1423, 1487, 1434, 1284, 1103, 951, 864, 873, 979, 1146,
    1326, 1448, 1459, 1370, 1213, 1045, 918, 870, 913, 1041, 1215, 1371, 1450, 1430, 1314, 1151, 995, 901, 881, 965,
    1111, 1278, 1404, 1445, 1388, 1250, 1087, 959, 896, 915, 1018, 1180, 1321, 1418, 1422, 1334, 1189, 1039, 940, 903,
    954, 1078, 1226, 1356, 1417, 1388, 1277, 1135, 1004, 926, 924, 1003, 1135, 1276, 1381, 1404, 1343, 1224, 1087, 978,
    925, 955, 1052, 1188, 1313, 1387, 1382, 1299, 1175, 1050, 958, 939, 989, 1100, 1231, 1343, 1385, 1350, 1249, 1126,
    1018, 954, 957, 1030, 1150, 1276, 1355, 1374, 1310, 1206, 1086, 992, 953, 983, 1074, 1193, 1304, 1366, 1348, 1272,
    1155, 1052, 975, 967, 1020, 1120, 1233, 1329, 1362, 1314, 1229, 1118, 1023, 975, 987, 1060, 1161, 1274, 1343, 1343,
    1287, 1187, 1086, 1001, 979, 1015, 1096, 1209, 1298, 1342, 1320, 1247, 1148, 1052, 991, 993, 1046, 1138, 1242, 1316,
    1332, 1295, 1211, 1112, 1032, 997, 1012, 1084, 1180, 1270, 1326, 1319, 1259, 1172, 1082, 1017, 998, 1039, 1116, 1214,
    1293, 1324, 1293, 1226, 1136, 1050, 1008, 1012, 1068, 1151, 1243, 1303, 1306, 1273, 1194, 1106, 1035, 1011, 1036, 1101,
    1188, 1270, 1302, 1295, 1238, 1159, 1074, 1027, 1022, 1060, 1133, 1219, 1284, 1300, 1273, 1206, 1126, 1060, 1023, 1038,
    1087, 1170, 1246, 1292, 1287, 1249, 1178, 1101, 1049, 1034, 1052, 1122, 1195, 1262, 1289, 1276, 1220, 1148, 1081, 1042,
    1042, 1081, 1149, 1222, 1272, 1285, 1251, 1196, 1124, 1065, 1043, 1060, 1105, 1173, 1239, 1276, 1264, 1234, 1172, 1103,
    1059, 1052, 1073, 1133, 1202, 1254, 1273, 1257, 1207, 1141, 1085, 1058, 1060, 1095, 1154, 1220, 1256, 1269, 1242, 1182,
    1119, 1074, 1058, 1070, 1119, 1182, 1234, 1268, 1259, 1218, 1158, 1105, 1072, 1064, 1087, 1143, 1202, 1244, 1261, 1246,
    1198, 1140, 1087, 1066, 1071, 1113, 1167, 1222, 1252, 1254, 1223, 1173, 1119, 1078, 1068, 1087, 1127, 1186, 1226, 1253,
    1244, 1204, 1154, 1107, 1079, 1076, 1103, 1151, 1204, 1240, 1249, 1230, 1177, 1134, 1095, 1076, 1084, 1121, 1172, 1214,
    1243, 1244, 1212, 1165, 1115, 1084, 1069, 1099, 1142, 1190, 1225, 1243, 1231, 1188, 1145, 1110, 1080, 1085, 1118, 1162,
    1202, 1237, 1239, 1214, 1172, 1131, 1095, 1081, 1097, 1132, 1176, 1217, 1235, 1230, 1195, 1155, 1114, 1087, 1089, 1113,
    1151, 1193, 1225, 1234, 1214, 1181, 1134, 1108, 1090, 1096, 1130, 1172, 1205, 1227, 1230, 1204, 1165, 1126, 1102, 1095,
    1110, 1146, 1180, 1215, 1228, 1220, 1188, 1151, 1124, 1100, 1101, 1127, 1156, 1193, 1219, 1223, 1199, 1174, 1142, 1108
};


#else
const uint16_t timeIntervals[] = {
653,
846,
1311,
1631,
1886,
1960,
1598,
1178,
950,
847,
850,
998,
1272,
1543,
1678,
1626,
1399,
1262,
1216,
1258,
1369,
1497,
1574,
1567,
1495,
1401,
1341,
1339,
1382,
1519,
1556,
1538,
1493,
1436,
1397,
1390,
1414,
1455,
1490,
1500,
1470,
1362,
1355,
1382,
1413,
1448,
1469,
1474,
1465,
1455,
1431,
1429,
1438,
1436,
1514,
1502,
1475,
1458,
1449,
1454,
1452,
1456,
1461,
1462,
1454,
1447,
1370,
1374,
1420,
1442,
1455,
1458,
1461,
1462,
1456,
1452,
1451,
1452,
1439,
1517,
1502,
1476,
1466,
1460,
1460,
1458,
1461,
1466,
1462,
1464,
1453,
1376,
1390,
1431,
1450,
1460,
1461,
1461,
1461,
1463,
1459,
1462,
1461,
1453,
1520,
1501,
1472,
1471,
1471,
1476,
1467,
1466,
1463,
1458,
1461,
1460,
1380,
1386,
1431,
1451,
1455,
1461,
1466,
1468,
1464,
1459,
1459,
1454,
1447,
1522,
1504,
1480,
1472,
1471,
1466,
1468,
1471,
1469,
1466,
1465,
1459,
1375,
1390,
1438,
1449,
1459,
1461,
1463,
1462,
1469,
1468,
1464,
1460,
1447,
1518,
1500,
1479,
1478,
1471,
1474,
1468,
1468,
1464,
1465,
1466,
1462,
1384,
1396,
1435,
1452,
1461,
1466,
1468,
1467,
1465,
1463,
1460,
1461,
1454,
1527,
1505,
1479,
1474,
1468,
1469,
1471,
1469,
1468,
1465,
1470,
1458,
1381,
1396,
1438,
1450,
1461,
1467,
1466,
1469,
1478,
1470,
1466,
1463,
1451,
1516,
1503,
1486,
1478,
1473,
1477,
1471,
1468,
1469,
1471,
1468,
1464,
1383,
1391,
1434,
1457,
1466,
1470,
1470,
1469,
1467,
1463,
1467,
1470,
1462,
1538,
1511,
1486,
1478,
1477,
1478,
1476,
1474,
1473,
1471,
1472,
1467,
1390,
1398,
1442,
1454,
1466,
1466,
1471,
1478,
1479,
1472,
1469,
1467,
1454,
1527,
1516,
1492,
1483,
1478,
1485,
1478,
1479,
1482,
1477,
1474,
1469,
1389,
1398,
1445,
1466,
1471,
1476,
1476,
1476,
1474,
1473,
1476,
1473,
1460,
1538,
1515,
1487,
1487,
1486,
1484,
1480,
1479,
1479,
1476,
1479,
1478,
1396,
1406,
1447,
1463,
1470,
1477,
1482,
1484,
1485,



};
#endif



#include <stdlib.h>


typedef struct {
    uint32_t baseline;        // 基线值 (定点数格式)
    uint16_t peak[PEAK_QUEUE_SIZE];
	
		
		uint32_t 	peakGruouMax;			//峰值队列中的最大值
	
    uint16_t 		size;
    uint16_t    peakMax;       //PEAK最大值 

	
    uint8_t	up_count; 					//高于基线计数	
    uint8_t below_count;      // 连续低于基线计数
    uint8_t res1;    // 峰值检测标志
    uint8_t peak_count;        //峰值个数 

    uint16_t* buff;
} peak_filter_t;

// 初始化滤波器
void peak_filter_init(peak_filter_t* ctx) {


	uint16_t lastPoint=ctx->size;		//最后几个值是FMAC
	
    ctx->below_count = 0;

    ctx->peak_count = 0;
	ctx->peakMax=0;
    uint16_t avgWindow=WINDOW_SIZE;
    if(lastPoint<WINDOW_SIZE)
    {
        avgWindow=0;
    }
    else
    {
        avgWindow= lastPoint- WINDOW_SIZE;  

    }


     ctx->baseline=(ctx->buff[lastPoint-1]);
    
		ctx->baseline<<=BASELINE_SHIFT;     //以最后30个数据平均值为基线
    for(uint16_t i=(lastPoint-1);i>avgWindow;i--)
    {
        uint32_t scaled_sample = (uint32_t)ctx->buff[i] << BASELINE_SHIFT;
        ctx->baseline = (ALPHA * ctx->baseline + INVERSE_ALPHA * scaled_sample) >> BASELINE_SHIFT;
    }
		ctx->peakGruouMax=0;
}

// 更新基线并检测峰值
int peak_filter_update(peak_filter_t* ctx, uint16_t cnt) {
    // 1. 跳变检测 (抗脉冲干扰)用次数滤波
	    int32_t sample=ctx->buff[cnt];
#if 0	

    int32_t avgSample=ctx->buff[cnt+1];
    avgSample/=2;
    if(abs(sample-avgSample)>MAX_SAMPLE_JUMP)
    {
        ctx->buff[cnt]=ctx->baseline>>8;
    }
#endif


    

    
    // 3. 指数平滑更新基线
    uint32_t scaled_sample = (uint32_t)sample << BASELINE_SHIFT;
    ctx->baseline = (ALPHA * ctx->baseline + INVERSE_ALPHA * scaled_sample) >> 8;
    
    // 4. 峰值检测逻辑
    uint32_t baseline_value = ctx->baseline >> BASELINE_SHIFT;
    
    if (sample > baseline_value + PEAK_THRESHOLD)
		{
        ctx->below_count = 0;
				ctx->up_count++;
        if (ctx->up_count >= BELOW_THRESHOLD)			//高于基准次数统计
				{
					ctx->up_count=BELOW_THRESHOLD;
				}	
					
        if(ctx->peakMax<sample)
        {
            ctx->peakMax=sample;
        }

    } 
    else {

			ctx->below_count++;
        if (ctx->below_count >= BELOW_THRESHOLD)
				{
						ctx->below_count=BELOW_THRESHOLD;
					
            if (ctx->up_count >= BELOW_THRESHOLD)		//需要高于基准后，低于基准才有效
						{
								ctx->up_count=0;
                ctx->peak[ctx->peak_count]=ctx->peakMax;
							
								if(ctx->peakMax>ctx->peakGruouMax)
								{
									ctx->peakGruouMax=ctx->peakMax;
								}
								if(ctx->peakGruouMax>baseline_value+200)		//先要有一个大脉冲
								{
								    ctx->peak_count++;
								}	


                ctx->peakMax=0;
                return 1;  // 检测到完整峰值
            }
        }
    } 

    

    return 0;
}
void    peak_filter_process(peak_filter_t* ctx)
{

   
    for(uint16_t i=1;i<ctx->size;i++)
    {
        if (peak_filter_update(ctx,i)) {
            if(ctx->peak_count>PEAK_QUEUE_SIZE)
            {
                     break;
            }
        }
    }
	
		if(ctx->peak_count>1)			//有检锅数
		{
		
			uint16_t oldPeak=ctx->peak[0];
			for(uint8_t i=1;i<ctx->peak_count;i++)
			{
				uint16_t 	nowPeak=ctx->peak[i];
				if(nowPeak+2>oldPeak)			//峰值不是递减
				{
						ctx->peak_count=i;	
						break;
				}			
				oldPeak=nowPeak;
			}
			
		}
		
		
		
} 

int16_t * pluse_getIntervalsAddress(uint8_t ch)		//测试用数据
{
    if(ch)
    {
        return (int16_t * ) timeIntervals1;
    }
    else
    {
        return (int16_t * )  timeIntervals;

    }

}

uint16_t 	pluse_getIntervalsSize(uint8_t ch)
{
    if(ch)
    {
        return sizeof(timeIntervals1)/sizeof(uint16_t);
    }
    else
    {
        return sizeof(timeIntervals)/sizeof(uint16_t);

    }
}


// ======== 使用示例 ========

uint8_t    pulse_check_process(uint16_t* buff,uint16_t size)
{
    peak_filter_t filter;
    filter.size=size;
    filter.buff=(uint16_t*)buff;
    peak_filter_init(&filter);
    peak_filter_process(&filter);
    return filter.peak_count;

}



void    pulse_check(void)
{
    peak_filter_t filter;
    filter.size=sizeof(timeIntervals1) / sizeof(uint16_t);
    filter.buff=(uint16_t*)timeIntervals1;
    peak_filter_init(&filter);
    peak_filter_process(&filter);
   




    // 输出结果
    printf("Time Interval Count: %u\n", filter.size);
		printf("Total Pulse Count: %u\n", filter.peak_count);
		
    for(uint8_t i=0;i<filter.peak_count;i++)
		{
				printf("Pulse %d max peak is : %d\n",i, filter.peak[i]);
		}    

}


